src/InformationRegisters/РасписанияОтчетовПоставщикамVMI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РасписанияОтчетовПоставщикамVMI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Частота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецМесяцаОтдельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧетНечет</Name>
					<Comment>1 - каждый, 2 - четный, 3 - нечетный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД77</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПериодаПоследнегоОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задержка</Name>
					<Comment>Задержка при отправке отчета на конец месяца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/РасписанияОтчетовПоставщикамVMI/Ext/RecordSetModule.bsl
Функция ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись)
	Если Запись.Периодичность = Перечисления.Периодичность.Неделя Тогда
		Если Запись.ДеньНедели = 1 Тогда
			Возврат " по понедельникам";
		ИначеЕсли Запись.ДеньНедели = 2 Тогда
			Возврат " по вторникам";
		ИначеЕсли Запись.ДеньНедели = 3 Тогда
			Возврат " по средам";
		ИначеЕсли Запись.ДеньНедели = 4 Тогда
			Возврат " по четвергам";
		ИначеЕсли Запись.ДеньНедели = 5 Тогда
			Возврат " по пятницам";
		ИначеЕсли Запись.ДеньНедели = 6 Тогда
			Возврат " по субботам";
		ИначеЕсли Запись.ДеньНедели = 7 Тогда
			Возврат " по воскресеньям";
		КонецЕсли;
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат (" до " + Строка(Запись.ЧислоМесяца) + "-го числа месяца, следующего за отчетным");
	Иначе
		Возврат (" до " + Строка(Запись.ЧислоМесяца) + "-го числа месяца, следующего за отчетным периодом");
	КонецЕсли;
	
		
КонецФункции

Процедура СформироватьИнформацию(Запись)
	Запись.Информация = "";
	
	Если Запись.Периодичность = Перечисления.Периодичность.День Тогда
		Если Запись.Частота = 1 Тогда
			Запись.Информация = "Каждый день, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
		ИначеЕсли Запись.Частота = 2 ИЛИ Запись.Частота = 3 ИЛИ Запись.Частота = 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" дня, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
		ИначеЕсли Запись.Частота > 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" дней, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");										
		КонецЕсли;
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Неделя Тогда
		Если Запись.Частота = 1 Тогда
			Запись.Информация = "Каждую неделю, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
			
		ИначеЕсли Запись.Частота = 2 ИЛИ Запись.Частота = 3 ИЛИ Запись.Частота = 4 Тогда
			Если Запись.ЧетНечет = 2 Тогда
				Запись.Информация = "Каждую четную неделю года, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
			ИначеЕсли Запись.ЧетНечет = 3 Тогда
				Запись.Информация = "Каждую нечетную неделю года, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
			Иначе
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" недели, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
			КонецЕсли;
		ИначеЕсли Запись.Частота > 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" недель, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");										
		КонецЕсли;
		
		Запись.Информация = Запись.Информация + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Месяц Тогда
		Если Запись.Частота = 1 Тогда
			Запись.Информация = "Каждый месяц, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
		ИначеЕсли Запись.Частота = 2 ИЛИ Запись.Частота = 3 ИЛИ Запись.Частота = 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" месяца, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
		ИначеЕсли Запись.Частота > 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" месяцев, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");										
		КонецЕсли;
		
		Запись.Информация = Запись.Информация + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Квартал Тогда
		Запись.Информация = "Каждый квартал, начиная с " + 
		Формат(Запись.НачальнаяДата, "ДЛФ=DD") + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Запись.Информация = "Каждое полугодие, начиная с " + 
		Формат(Запись.НачальнаяДата, "ДЛФ=DD") + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Год Тогда
		Запись.Информация = "Каждый год, начиная с " + 
		Формат(Запись.НачальнаяДата, "ДЛФ=DD") + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
				
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Если Не Отказ Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			СформироватьИнформацию(Запись);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
